nasensei/stm32f3-magnetometer-servo-project/7.2_Timer_Interface/timer_PWM_7-2/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

#include <stdint.h>
#include "stm32f303xc.h"

#if !defined(__SOFT_FP__) && defined(__ARM_FP)
  #warning "FPU is not initialized, but the project is compiling for an FPU. Please initialize the FPU before use."
#endif

typedef enum {
    MODE_PWM,
    MODE_NORMAL
} timer_mode_t;

typedef struct {
    timer_mode_t mode;
    uint32_t     on_time_ms;
    uint32_t     off_time_ms;
    uint8_t      led_mask;
} timer_config_t;

static volatile timer_config_t *active_config = 0x00; // pointer to whichever config is active

#define CPU_FREQ_HZ     8000000UL
#define PSC_VAL         7UL
#define TICK_FREQ_HZ    (CPU_FREQ_HZ / (PSC_VAL + 1))  // 1,000,000 Hz → 1µs/tick

static volatile uint8_t  is_on_phase   = 1;

//-----------------------------interrupts

static void (*timer_callback)(void) = 0x00; //later this will adopt the address of timer_task //static to make it private

void TIM2_IRQHandler(void)
{
    if (TIM2->SR & TIM_SR_UIF) {
        TIM2->SR &= ~TIM_SR_UIF;   // clear interrupt flag

        if (timer_callback != 0) {
            timer_callback();
        }
    }
}

//-----------------------------tim2 config

void enable_clock_tim2(void) {
	RCC->APB1ENR |= RCC_APB1ENR_TIM2EN;
}

void enable_clock_LED(void) {
	RCC->AHBENR |= RCC_AHBENR_GPIOEEN;
}

//----------------------------led config

void config_LED(void) {
	uint16_t *led_output_registers = ((uint16_t *)&(GPIOE->MODER)) + 1;
	*led_output_registers = 0x5555;
}

//----------------------------ARR controller

static uint32_t ms_to_arr(uint32_t ms)
{
    return (TICK_FREQ_HZ / 1000UL) * ms - 1UL;
}

static void set_arr(uint32_t ms)
{
    TIM2->ARR = ms_to_arr(ms);
    TIM2->EGR = TIM_EGR_UG;   // latch new ARR, clears UIF
    TIM2->SR &= ~TIM_SR_UIF;  // clear the UIF set by EGR_UG
}

//-------------------------set prescalar

void set_prescaler(uint32_t prescaler) {
	//prescaler: 8MHz (input clock)/(7 (PSC) + 1) = 1MHz (1 tick per microecond)
	if (TIM2->CR1 & TIM_CR1_CEN) {
		TIM2->CR1 &= ~TIM_CR1_CEN;
		TIM2->PSC = prescaler;
		TIM2->CR1 |= TIM_CR1_CEN;
	}
	else {
		TIM2->PSC = prescaler;
	}
}

//------------------------call back functions

void timer_task(void)
{
	uint8_t *leds = (uint8_t *)&GPIOE->ODR + 1;
	*leds ^= active_config->led_mask;   // always toggle

	if (active_config->mode == MODE_PWM) {
		if (is_on_phase) {
			is_on_phase = 0;
			set_arr(active_config->off_time_ms);
		} else {
			is_on_phase = 1;
			set_arr(active_config->on_time_ms);
		}
	}
	// MODE_NORMAL: nothing extra needed
}

//--------------------------timers

void tim2_init(timer_config_t *config, void (*callback)(void)) {
	active_config = config;

	enable_clock_tim2();

	timer_callback = callback; //send the addy of callback funciton(timer_task) to timer_callback

	TIM2->CR1 &= ~TIM_CR1_CEN;

	set_prescaler(7); //set prescaler to 7 so it's counting every 1us

	uint32_t initial_ms = (config->mode == MODE_PWM) ? config->on_time_ms: config->off_time_ms;
	TIM2->ARR   = ms_to_arr(initial_ms);
	TIM2->CNT   = 0;
	TIM2->EGR   = TIM_EGR_UG;        // latch PSC and ARR
	TIM2->SR   &= ~TIM_SR_UIF;       // clear flag EGR_UG just set
	TIM2->DIER |= TIM_DIER_UIE;

	NVIC_EnableIRQ(TIM2_IRQn);
	TIM2->CR1  |= TIM_CR1_CEN;
}

//-------------------main

int main(void)
{
    /* Loop forever */

	enable_clock_LED();
	config_LED();

	// PWM mode — 1ms on, 19ms off
	    timer_config_t pwm_cfg = {
	        .mode        = MODE_PWM,
	        .on_time_ms  = 1,
	        .off_time_ms = 19,
	        .led_mask    = 0x55
	    };

	    // Normal mode — steady 500ms toggle
	    timer_config_t normal_cfg = {
	        .mode        = MODE_NORMAL,
	        .off_time_ms = 500,
	        .led_mask    = 0x55
	    };

	    timer_config_t *configs[] = { &pwm_cfg, &normal_cfg };
	    uint8_t active_idx = 0; //0 for pwm and 1 for normal config

	    tim2_init(configs[active_idx], timer_task);   // swap to &normal_cfg to change mode

	    while (1) {}
}
